package com.carker.bean;

import com.google.gson.Gson;
import com.google.gson.annotations.SerializedName;

import java.util.List;

/**
 * Created by PC on 2015/9/29.
 */
public class DurgSearch {

    /**
     * total : 1825
     * tngou : [{"count":0,"description":"功能主治 清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。","fcount":0,"id":20,"img":"http://tnfs.tngou.net/img/drug/081018/3ae4831c202e55785d72a84ed3d020c7.jpg","keywords":"扁桃体炎 服用 症状 药品 收起 ","message":"【药品名称】   通用名称：北豆根胶囊 英文名称：Capsulae Menispermi  【成份】   北豆根。辅料为淀粉、糊精，硬脂酸镁。  【性状】   本品为胶囊剂，内容物为灰棕色至黑棕色颗粒或粉末，味苦。  【功能主治】  清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。 [展开] 清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。 [收起]  【规格】   30毫克   【用法用量】  口服。一次2粒，一日三次。 [展开] 口服。一次2粒，一日三次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  尚不明确。 [展开]  尚不明确。  [收起]  【注意事项】  1.忌辛辣、鱼腥食物； 2.不宜在服药期间同时服用温补性中成药； 3.凡风寒咽痛症见恶寒、无汗者不宜使用，脾胃虚寒者慎用； 4.急性咽炎服药3天后、慢性咽炎服药7天后症状无改善或出现其他症状，应去医院就诊； 5.急性扁桃体炎用药3天后症状无改善，或出现其他如高热、扁桃体周围炎等症状，应去医院就诊； 6.急性化脓性扁桃体炎，因症情较重，应去医院就诊； 7.按照用法用量服用，儿童应在医师指导下服用； 8.药品性状发生改变时禁止服用； 9.儿童必须在成人的监护下使用； 10.请将此药品放在儿童不能接触的地方； [展开] 1.忌辛辣、鱼腥食物； 2.不宜在服药期间同时服用温补性中成药； 3.凡风寒咽痛症见恶寒、无汗者不宜使用，脾胃虚寒者慎用； 4.急性咽炎服药3天后、慢性咽炎服药7天后症状无改善或出现其他症状，应去医院就诊； 5.急性扁桃体炎用药3天后症状无改善，或出现其他如高热、扁桃体周围炎等症状，应去医院就诊； 6.急性化脓性扁桃体炎，因症情较重，应去医院就诊； 7.按照用法用量服用，儿童应在医师指导下服用； 8.药品性状发生改变时禁止服用； 9.儿童必须在成人的监护下使用； 10.请将此药品放在儿童不能接触的地方；  [收起]  【药物相互作用】  如与其他药品同时使用可能或发生相互作用，详情请咨询医师或药师。 [展开]  如与其他药品同时使用可能或发生相互作用，详情请咨询医师或药师。  [收起]  【贮藏】    密封。   【包装】    30毫克x20粒 30毫克x20片 30毫克x20# 30毫克x10粒x2板 &nbsp;&nbsp;   【有效期】    24个月   【批准文号】    国药准字Z10960048   【批准日期】    2010-4-13 0:00:00   【说明书修订日期】    2010年9月6日   【生产企业】   企业名称：伊春药业有限公司  生产地址：伊春市翠东高新技术工业园区  联系电话：0458-3602854 如有问题可与生产企业联系  【产地】","name":"北豆根胶囊","price":11.5,"rcount":0,"tag":"扁桃体炎,咳嗽咳痰,其他,清热解毒,其他药品","type":"中成药"},{"count":0,"description":"适用于敏感菌所致的尿路感染、淋病、前列腺炎、肠道感染和伤寒及其他沙门菌感染。","fcount":0,"id":132,"img":"http://tnfs.tngou.net/img/drug/081018/8eb639b9e26e637b2b57675a4b5f54e5.jpg","keywords":"本品 应用 剂量 尿路感染 血药浓度 ","message":"【药品名称】   通用名称：诺氟沙星胶囊 英文名称：Norfloxacin  【成份】   本品的主要成分为诺氟沙星,其化学名为1-乙基-6-氟-1,4-二氢-4-氧代-7-(1-哌嗪基)-3-喹啉羧酸。 分子式：C16H18FN3O3 分子量：319.24  【性状】    本品为胶囊剂，内容物为白色至淡黄色粉末。   【 适应症 】  适用于敏感菌所致的尿路感染、淋病、前列腺炎、肠道感染和伤寒及其他沙门菌感染。 [展开] 适用于敏感菌所致的尿路感染、淋病、前列腺炎、肠道感染和伤寒及其他沙门菌感染。 [收起]  【规格】   0.1克   【用法用量】  口服 1&nbsp;大肠埃希菌、肺炎克雷伯菌及奇异变形菌所致的急性单纯性下尿路感染一次400mg，一日2次，疗程3日。 2&nbsp;其他病原菌所致的单纯性尿路感染剂量同上，疗程7～10日。 3&nbsp;复杂性尿路感染剂量同上，疗程10～21日。 4&nbsp;单纯性淋球菌性尿道炎单次800～1200mg。 5&nbsp;急性及慢性前列腺炎一次400mg，一日2次，疗程28日。 6&nbsp;肠道感染一次300～400mg，一日2次，疗程5～7日。 7&nbsp;伤寒沙门菌感染一日800～1200mg，分2～3次服用，疗程14～21日。 [展开]  口服 1&nbsp;大肠埃希菌、肺炎克雷伯菌及奇异变形菌所致的急性单纯性下尿路感染一次400mg，一日2次，疗程3日。 2&nbsp;其他病原菌所致的单纯性尿路感染剂量同上，疗程7～10日。 3&nbsp;复杂性尿路感染剂量同上，疗程10～21日。 4&nbsp;单纯性淋球菌性尿道炎单次800～1200mg。 5&nbsp;急性及慢性前列腺炎一次400mg，一日2次，疗程28日。 6&nbsp;肠道感染一次300～400mg，一日2次，疗程5～7日。 7&nbsp;伤寒沙门菌感染一日800～1200mg，分2～3次服用，疗程14～21日。  [收起]  【不良反应】  1 胃肠道反应较为常见，可表现为腹部不适或疼痛、腹泻、恶心或呕吐。 2 中枢神经系统反应可有头昏、头痛、嗜睡或失眠。 3 过敏反应皮疹、皮肤瘙痒，偶可发生渗出性多性红斑及血管神经性水肿。少数患者有光敏反应。 4 偶可发生：(1)癫痫发作、精神异常、烦躁不安、意识障碍、幻觉、震颤。(2)血尿、发热、皮疹等间质性肾炎表现。(3)静脉炎。(4)结晶尿，多见于高剂量应用时。(5)关节疼痛。 5 少数患者可发生血清氨基转移酶升高、血尿素氮增高及周围血象白细胞降低，多属轻度，并呈一过性。 [展开] 1 胃肠道反应较为常见，可表现为腹部不适或疼痛、腹泻、恶心或呕吐。 2 中枢神经系统反应可有头昏、头痛、嗜睡或失眠。 3 过敏反应皮疹、皮肤瘙痒，偶可发生渗出性多性红斑及血管神经性水肿。少数患者有光敏反应。 4 偶可发生：(1)癫痫发作、精神异常、烦躁不安、意识障碍、幻觉、震颤。(2)血尿、发热、皮疹等间质性肾炎表现。(3)静脉炎。(4)结晶尿，多见于高剂量应用时。(5)关节疼痛。 5 少数患者可发生血清氨基转移酶升高、血尿素氮增高及周围血象白细胞降低，多属轻度，并呈一过性。 [收起]  【禁忌】  对本品及氟喹诺酮类药过敏的患者禁用。 [展开] 对本品及氟喹诺酮类药过敏的患者禁用。 [收起]  【注意事项】  1 本品宜空腹服用，并同时饮水250ml。 2 由于目前大肠埃希菌对诺氟沙星耐药者多见，应在给药前留取尿标本培养，参考细菌药敏结果调整用药。 3 本品大剂量应用或尿pH值在7以上时可发生结晶尿。为避免结晶尿的发生，宜多饮水，保持24小时排尿量在1200ml以上。 4 肾功能减退者，需根据肾功能调整给药剂量。 5 应用氟喹诺酮类药物可发生中、重度光敏反应。应用本品时应避免过度暴露于阳光，如发生光敏反应需停药。 6 葡萄糖-6-磷酸脱氢酶缺乏患者服用本品，极个别可能发生溶血反应。 7 喹诺酮类包括本品可致重症肌无力症状加重，呼吸肌无力而危及生命。重症肌无力患者应用喹诺酮类包括本品应特别谨慎。 8 肝功能减退时，如属重度（肝硬化腹水）可减少药物清除，血药浓度增高，肝、肾功能均减退者尤为明显，均需权衡利弊后应用，并调整剂量。 9 原有中枢神经系统疾病患者，例如癫痫及癫痫病史者均应避免应用，有指征时需仔细权衡利弊后应用。 [展开] 1 本品宜空腹服用，并同时饮水250ml。 2 由于目前大肠埃希菌对诺氟沙星耐药者多见，应在给药前留取尿标本培养，参考细菌药敏结果调整用药。 3 本品大剂量应用或尿pH值在7以上时可发生结晶尿。为避免结晶尿的发生，宜多饮水，保持24小时排尿量在1200ml以上。 4 肾功能减退者，需根据肾功能调整给药剂量。 5 应用氟喹诺酮类药物可发生中、重度光敏反应。应用本品时应避免过度暴露于阳光，如发生光敏反应需停药。 6 葡萄糖-6-磷酸脱氢酶缺乏患者服用本品，极个别可能发生溶血反应。 7 喹诺酮类包括本品可致重症肌无力症状加重，呼吸肌无力而危及生命。重症肌无力患者应用喹诺酮类包括本品应特别谨慎。 8 肝功能减退时，如属重度（肝硬化腹水）可减少药物清除，血药浓度增高，肝、肾功能均减退者尤为明显，均需权衡利弊后应用，并调整剂量。 9 原有中枢神经系统疾病患者，例如癫痫及癫痫病史者均应避免应用，有指征时需仔细权衡利弊后应用。 [收起]  【特殊人群用药】   儿童注意事项：  本品在婴幼儿及18岁以下青少年的安全性尚未确立。但本品用于数种幼龄动物时，可致关节病变。本品不宜用于18岁以下的小儿及青少年。 妊娠与哺乳期注意事项： 曾用猴进行繁殖研究，剂量高达人用量的10倍，发现本品可致流产。该剂量在猴的血浆峰浓度(Cmax)约为人的2倍。本品在动物中并未证实有致畸作用。然而，在孕妇并未进行合适的、有良好对照的研究，因此本品不宜用于孕妇。本品是否经乳汁分泌尚缺乏资料。当乳妇应用200mg本品时，乳汁中不能检出该药。然而，由于研究剂量较小，且本类药物的其他品种经乳汁分泌，加之对新生儿及婴幼儿潜在的严重不良反应，乳妇应避免应用本品或于应用时停止哺乳。 老人注意事项： 老年患者常有肾功能减退，因本品部分经肾排出，需减量应用。   【药物相互作用】  1&nbsp; 尿碱化剂可减少本品在尿中的溶解度，导致结晶尿和肾毒性。 2&nbsp; 本品与茶碱类合用时可能由于与细胞色素P450结合部位的竞争性抑制，导致茶碱类的肝清除明显减少，血消除半衰期(t1/2?)延长，血药浓度升高，出现茶碱中毒症状，如恶心、呕吐、震颤、不安、激动、抽搐、心悸等，故合用时应测定茶碱类血药浓度和调整剂量。 3&nbsp; 环孢素与本品合用，可使前者的血药浓度升高，必须监测环孢素血浓度，并调整剂量。 4&nbsp; 本品与抗凝药华法林同用时可增强后者的抗凝作用，合用时应严密监测患者的凝血酶原时间。 5&nbsp; 丙磺舒可减少本品自肾小管分泌约50%，合用时可因本品血浓度增高而产生毒性。 6&nbsp; 本品与呋喃妥因有拮抗作用，不推荐联合应用。 7&nbsp; 多种维生素，或其他含铁、锌离子的制剂及含铝或镁的制酸药可减少本品的吸收，建议避免合用，不能避免时在本品服药前2小时，或服药后6小时服用。 8&nbsp; 去羟肌苷（didanosine,DDI）可减少本品的口服吸收，因其制剂中含铝及镁，可与氟喹诺酮类螯合，故不宜合用。 9&nbsp; 本品干扰咖啡因的代谢，从而导致咖啡因清除减少，血消除半衰期(t1/2?)延长，并可能产生中枢神经系统毒性。 [展开]  1&nbsp; 尿碱化剂可减少本品在尿中的溶解度，导致结晶尿和肾毒性。 2&nbsp; 本品与茶碱类合用时可能由于与细胞色素P450结合部位的竞争性抑制，导致茶碱类的肝清除明显减少，血消除半衰期(t1/2?)延长，血药浓度升高，出现茶碱中毒症状，如恶心、呕吐、震颤、不安、激动、抽搐、心悸等，故合用时应测定茶碱类血药浓度和调整剂量。 3&nbsp; 环孢素与本品合用，可使前者的血药浓度升高，必须监测环孢素血浓度，并调整剂量。 4&nbsp; 本品与抗凝药华法林同用时可增强后者的抗凝作用，合用时应严密监测患者的凝血酶原时间。 5&nbsp; 丙磺舒可减少本品自肾小管分泌约50%，合用时可因本品血浓度增高而产生毒性。 6&nbsp; 本品与呋喃妥因有拮抗作用，不推荐联合应用。 7&nbsp; 多种维生素，或其他含铁、锌离子的制剂及含铝或镁的制酸药可减少本品的吸收，建议避免合用，不能避免时在本品服药前2小时，或服药后6小时服用。 8&nbsp; 去羟肌苷（didanosine,DDI）可减少本品的口服吸收，因其制剂中含铝及镁，可与氟喹诺酮类螯合，故不宜合用。 9&nbsp; 本品干扰咖啡因的代谢，从而导致咖啡因清除减少，血消除半衰期(t1/2?)延长，并可能产生中枢神经系统毒性。  [收起]  【药理作用】  本品为氟喹诺酮类抗菌药，具广谱抗菌作用，尤其对需氧革兰阴性杆菌的抗菌活性高，对下列细菌在体外具良好抗菌作用：肠杆菌科的大部分细菌，包括枸椽酸杆菌属、阴沟肠杆菌、产气肠杆菌等肠杆菌属、大肠埃希菌、克雷伯菌属、变形菌属、沙门菌属、志贺菌属、弧菌属、耶尔森菌等。诺氟沙星体外对多重耐药菌亦具抗菌活性。对青霉素耐药的淋病奈瑟菌、流感嗜血杆菌和卡他莫拉菌亦有良好抗菌作用。诺氟沙星为杀菌剂，通过作用于细菌DNA螺旋酶的A亚单位，抑制DNA的合成和复制而导致细菌死亡。 [展开]  本品为氟喹诺酮类抗菌药，具广谱抗菌作用，尤其对需氧革兰阴性杆菌的抗菌活性高，对下列细菌在体外具良好抗菌作用：肠杆菌科的大部分细菌，包括枸椽酸杆菌属、阴沟肠杆菌、产气肠杆菌等肠杆菌属、大肠埃希菌、克雷伯菌属、变形菌属、沙门菌属、志贺菌属、弧菌属、耶尔森菌等。诺氟沙星体外对多重耐药菌亦具抗菌活性。对青霉素耐药的淋病奈瑟菌、流感嗜血杆菌和卡他莫拉菌亦有良好抗菌作用。诺氟沙星为杀菌剂，通过作用于细菌DNA螺旋酶的A亚单位，抑制DNA的合成和复制而导致细菌死亡。  [收起]  【贮藏】     遮光，密封保存。    【包装】    0.1g 0.1g/粒x30粒x1瓶/瓶 0.1gx30粒 &nbsp;&nbsp;   【有效期】    12个月   【批准文号】    国药准字H11020296   【批准日期】    2010-8-11 0:00:00   【生产企业】   企业名称：北京优你特药业有限公司  生产地址：北京市大兴工业开发区金苑路甲29号；北京市大兴区西红门镇欣荣南大街107号  【产地】","name":"诺氟沙星胶囊","price":24.5,"rcount":0,"tag":"胰腺炎,肾炎,痢疾,失眠,肝硬化,淋病,过敏,阴道炎,其他,前列腺用药,维生素,癫痫","type":"化学药品"},{"count":0,"description":"功能主治 制酸止痛。用于胃酸过多，胃痛，胃及十二指肠溃疡。","fcount":0,"id":250,"img":"http://tnfs.tngou.net/img/drug/081018/84ede5dfd193d4c610dc800361e7b03b.jpg","keywords":"本品 相互作用 医师 收起 江苏省 ","message":"【药品名称】   通用名称：胃药胶囊   【成份】   延胡索(醋制)、枯矾、海螵蛸(漂)、鸡蛋壳(炒)、青木香、珍珠母(煅)。   【性状】    本品为胶囊剂，内容物为红、黄、白、棕四种彩色小颗粒；气香，味苦。   【功能主治】  制酸止痛。用于胃酸过多，胃痛，胃及十二指肠溃疡。 [展开] 制酸止痛。用于胃酸过多，胃痛，胃及十二指肠溃疡。 [收起]  【规格】   每粒装0.5克   【用法用量】  口服。一次2～3粒，一日3次。 [展开] 口服。一次2～3粒，一日3次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【注意事项】  1忌食辛辣刺激性食物。 2不适用于脾胃阴虚，主要表现为口干、舌红少津、大便干。 3本品不宜久服，服药三天后症状无减轻或有加重者，应立即停药并到医院就诊。 4孕妇慎用。 5按照用法用量服用，小儿、年老体弱者应在医师指导下服用。 6对本品过敏者禁用，过敏体质者慎用。 7本品性状发生改变时禁止使用。 8儿童必须在成人监护下使用。 9请将本品放在儿童不能接触的地方。 10如正在使用其他药品，使用本品前请咨询医师或药师。 [展开] 1忌食辛辣刺激性食物。 2不适用于脾胃阴虚，主要表现为口干、舌红少津、大便干。 3本品不宜久服，服药三天后症状无减轻或有加重者，应立即停药并到医院就诊。 4孕妇慎用。 5按照用法用量服用，小儿、年老体弱者应在医师指导下服用。 6对本品过敏者禁用，过敏体质者慎用。 7本品性状发生改变时禁止使用。 8儿童必须在成人监护下使用。 9请将本品放在儿童不能接触的地方。 10如正在使用其他药品，使用本品前请咨询医师或药师。 [收起]  【药物相互作用】  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [展开]  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。  [收起]  【贮藏】     密闭，防潮。    【包装】    0.5gx30片 0.5gx30粒 &nbsp;&nbsp;   【批准文号】    国药准字Z32020325   【批准日期】    2010-8-20 0:00:00   【生产企业】   企业名称：江苏七0七天然制药有限公司  生产地址：江苏省镇江市朱方路102号  联系电话：0511-85634711，85617707 如有问题可与生产企业联系  【产地】","name":"胃药胶囊","price":10.5,"rcount":0,"tag":"过敏,其他,其他药品,胃脘疼痛","type":"中成药"},{"count":0,"description":"功能主治 扩张冠状心血管，改善心肌供血量，降低血脂。用于治疗冠心病，心绞痛，胸闷心悸，高血压等。","fcount":0,"id":257,"img":"http://tnfs.tngou.net/img/drug/081018/e4eec7763f1380ba83946013820eef32.jpg","keywords":"相互作用 收起 展开 药物 经济技术开发区 ","message":"【药品名称】   通用名称：心安胶囊   【成份】   山楂叶  【性状】   本品为胶囊剂，内容物为棕褐色的颗粒；味微苦。  【功能主治】  扩张冠状心血管，改善心肌供血量，降低血脂。用于治疗冠心病，心绞痛，胸闷心悸，高血压等。 [展开] 扩张冠状心血管，改善心肌供血量，降低血脂。用于治疗冠心病，心绞痛，胸闷心悸，高血压等。 [收起]  【规格】   每粒装0.4克(含总黄铜80毫克)   【用法用量】  口服。一次3粒，一日2～3次。 [展开] 口服。一次3粒，一日2～3次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【注意事项】  请遵医嘱。 [展开] 请遵医嘱。  [收起]  【药物相互作用】  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [展开] 如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [收起]  【贮藏】    密封。   【包装】    每粒装0.4g（含总黄酮80毫克） 0.4gx12片x3板 0.4g（含总黄酮80毫克）x12片x3板 0.4克x12片x3板 0.4g(含总黄酮80毫克)x12\"片x3板 &nbsp;&nbsp;   【有效期】    18个月   【批准文号】    国药准字Z20055471   【批准日期】    2010-11-19 0:00:00   【生产企业】   企业名称：哈尔滨红太阳健康产业集团有限公司  生产地址：哈尔滨市平房经济技术开发区渤海35号  联系电话：0451-84823463,84608850,84826569  如有问题可与生产企业联系  【产地】","name":"心安胶囊","price":19.2,"rcount":0,"tag":"高血压,心脏及冠脉疾病,其他","type":"中成药"},{"count":0,"description":"【批准文号】国药准字Z20064264【药品类型】清热解毒【中文名】云峰药业黄柏胶囊【产品英文名】【生产企业】贵州云峰药业有限公司【功能主治】清热燥湿，泻火除蒸，解毒疗疮","fcount":0,"id":278,"img":"http://tnfs.tngou.net/img/drug/081018/5aa8ec79e11f2b0f2badf6826e888ec7.jpg","keywords":"相关 暂无 信息 药品 用药 ","message":"【批准文号】 国药准字Z20064264 【药品类型】 清热解毒 【中文名】 云峰药业 黄柏胶囊 【产品英文名】  【生产企业】 贵州云峰药业有限公司 【功能主治】 清热燥湿，泻火除蒸，解毒疗疮。用于湿热泻痢，黄疸，带下，热淋，脚气，痿，骨蒸劳热，盗汗，遗精，疮疡肿毒，湿疹瘙痒。 【药品性状】 本品为胶囊剂，内容物为黄色的粉末；味苦。 【药品禁忌】 暂无相关信息 【药理作用】 暂无相关信息 【药物相互作用】 暂无相关信息 【不良反应】 暂无相关信息 【产品规格】 每粒装0.43g(相当于原药材1g) 【包装规格】  【药品成分】 黄柏 【孕妇用药】 暂无相关信息 【儿童用药】 暂无相关信息 【老年患者用药】 暂无相关信息 【用法用量】 口服，一次3～4粒，一日3～4次。 【贮藏方法】 密封。 【注意事项】 暂无相关信息 \u2014 该说明书仅作参考","name":"黄柏胶囊","price":196,"rcount":0,"tag":"清热解毒","type":"中成药"},{"count":0,"description":"功能主治 宁心安神，健脾和胃。用于失眠健忘，身体虚弱，神经衰弱。","fcount":0,"id":283,"img":"http://tnfs.tngou.net/img/drug/081018/ce5a16932610edef49822f2038ed69d3.jpg","keywords":"宁心安神 本品 药品 收起 明确 ","message":"【药品名称】   通用名称：灵芝胶囊   【成份】   　　灵芝  【性状】    　　本品为胶囊剂，内容物为棕褐色粉末，味苦，微涩。   【功能主治】  　　宁心安神，健脾和胃。用于失眠健忘，身体虚弱，神经衰弱。 [展开] 　　宁心安神，健脾和胃。用于失眠健忘，身体虚弱，神经衰弱。 [收起]  【规格】   每粒装0.27克   【不良反应】  　　尚未明确 [展开] 　　尚未明确 [收起]  【禁忌】  　　尚未明确 [展开] 　　尚未明确 [收起]  【注意事项】  　　1.本品宜餐后服。 2.服本品一周后症状未见改善，或症状加重者，应立即停药并去医院就诊。 3.药品性状发生改变时禁止服用。 4.儿童必须在成人监护下使用。 5.请将此药品放在儿童不能接触的地方。 6.如正在服用其他药品，使用本品前请咨询医师或药师。 [展开] 　　1.本品宜餐后服。 2.服本品一周后症状未见改善，或症状加重者，应立即停药并去医院就诊。 3.药品性状发生改变时禁止服用。 4.儿童必须在成人监护下使用。 5.请将此药品放在儿童不能接触的地方。 6.如正在服用其他药品，使用本品前请咨询医师或药师。 [收起]  【药物相互作用】  　　尚未明确 [展开]  　　尚未明确  [收起]  【药理作用】  　　宁心安神，健脾和胃。 [展开]  　　宁心安神，健脾和胃。  [收起]  【贮藏】     　　密封    【包装】    每粒装0.27g &nbsp;&nbsp;   【有效期】    36个月。   【批准文号】    国药准字Z22026069   【批准日期】    2010-4-28 0:00:00   【生产企业】   企业名称：吉林敖东洮南药业股份有限公司  联系电话：0436-6225278,6335023,6335024 如有问题可与生产企业联系  【产地】","name":"灵芝胶囊","price":685,"rcount":0,"tag":"失眠,胰腺癌,神经衰弱,其他,其他药品","type":"中成药"},{"count":0,"description":"用法用量口服，一次2粒，一日三次。","fcount":0,"id":540,"img":"http://tnfs.tngou.net/img/drug/081018/69d3f56a51dd6d5f194abfe5d449abaf.jpg","keywords":"肠溃疡 展开 口服 名称 收起 ","message":"【药品名称】   通用名称：溃疡胶囊   【功能主治】  制酸止痛，生肌收敛，用于胃脘疼痛，呕恶泛酸，胃及十二脂肠溃疡。 [展开] 制酸止痛，生肌收敛，用于胃脘疼痛，呕恶泛酸，胃及十二脂肠溃疡。 [收起]  【规格】   每粒装0.3克   【用法用量】  口服。一次2粒，一日三次。 [展开] 口服。一次2粒，一日三次。  [收起]  【包装】    0.3gx12片x2板 0.3g/粒x10粒x2板/盒 0.3gx30粒 0.3gx24粒 0.3gx36粒 0.3gx10粒x2板 0.3gx12粒x3板 0.3gx12粒x2板 &nbsp;&nbsp;   【批准文号】    国药准字Z43020129   【批准日期】    2010-1-14 0:00:00   【生产企业】   企业名称：长沙市泰宝制药有限公司才松堂制药厂  联系电话：0736-2745818 如有问题可与生产企业联系  【产地】","name":"溃疡胶囊","price":473,"rcount":0,"tag":"溃疡类,胃脘疼痛","type":"中成药"},{"count":0,"description":"清热，平肝，明目。用于惊风抽搐，咽喉肿痛。","fcount":0,"id":558,"img":"http://tnfs.tngou.net/img/drug/081018/7b0e4979b1d0639741413f00f2a09811.jpg","keywords":"收起 相互作用 展开 药物 咨询 ","message":"【药品名称】   通用名称：熊胆胶囊   【成份】   熊胆粉  【性状】   本品为胶囊剂，内容物为淡黄棕色粉末；味苦、微腥。  【功能主治】  清热、平肝、明目，用于惊风抽搐，咽喉肿痛。 [展开] 清热、平肝、明目，用于惊风抽搐，咽喉肿痛。 [收起]  【用法用量】  口服。一次2-3粒，一日3次。或遵医嘱。 [展开] 口服。一次2-3粒，一日3次。或遵医嘱。 [收起]  【不良反应】  少数病人出现腹痛、腹泻及胃部刺激症状。 [展开] 少数病人出现腹痛、腹泻及胃部刺激症状。 [收起]  【禁忌】  孕妇禁用。 [展开]  孕妇禁用。  [收起]  【注意事项】  1.建议饭后30分钟服用 2.肠道功能障碍者慎用。 3.当药品性状发生改变时，禁止使用。 4.儿童必须在成人的监护下使用。 5.请将此药品放在儿童不能接触的地方。 6.请按照用法用量使用，长期使用应向医生咨询。 7.请将包装物分类弃之。 8.谨防玻璃瓶破碎，对人体造成伤害。 [展开] 1.建议饭后30分钟服用 2.肠道功能障碍者慎用。 3.当药品性状发生改变时，禁止使用。 4.儿童必须在成人的监护下使用。 5.请将此药品放在儿童不能接触的地方。 6.请按照用法用量使用，长期使用应向医生咨询。 7.请将包装物分类弃之。 8.谨防玻璃瓶破碎，对人体造成伤害。 [收起]  【药物相互作用】  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [展开]  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。  [收起]  【贮藏】    密封，避光，置阴凉干燥处。   【包装】    每粒装0.25g（含熊胆粉50毫克） &nbsp;&nbsp;   【批准文号】    国药准字Z62020298   【生产企业】   企业名称：甘肃独一味生物制药有限责任公司  生产地址：甘肃康县王坝独一味工业园区  联系电话：0939-5120245  如有问题可与生产企业联系  【产地】","name":"熊胆胶囊","price":189,"rcount":0,"tag":"胆结石,其他,咽痛音哑","type":"中成药"},{"count":0,"description":"适应症 　　1.本品与其他抗结核药联合用于各种结核病的初治与复治，包括结核性脑膜炎的治疗。 2.本品与其他药物联合用于麻风、非结核分枝杆菌感染的治疗。 3.本品与万古...","fcount":0,"id":628,"img":"http://tnfs.tngou.net/img/drug/081018/753e756ffcb55fb8250a54b24cc792ff.jpg","keywords":"利福平 血药浓度 患者 肝功能 本品 ","message":"【药品名称】   通用名称：利福平胶囊 英文名称：Rifampicin  【成份】   主要成分为利福平。  【性状】    本品为胶囊剂，内含鲜红色或暗红色的结晶性粉末。   【 适应症 】  1.结核病主用于对其它抗结核药物已有耐药性或不能耐受者。 2.耐药性金黄色葡萄球菌感染。主用于较严重的急性肺部感染、肝脓肿、胆道感染，败血症等。 [展开] 1.结核病主用于对其它抗结核药物已有耐药性或不能耐受者。 2.耐药性金黄色葡萄球菌感染。主用于较严重的急性肺部感染、肝脓肿、胆道感染，败血症等。  [收起]  【规格】   0.15克   【用法用量】  应空腹服药。 1&nbsp;抗结核治疗成人：口服，一日0.45g～0.60g，空腹顿服，每日不超过1.2g；1个月以上小儿每日按体重10～20mg/kg，空腹顿服，每日量不超过0.6g。 2&nbsp;脑膜炎奈瑟菌带菌者：成人5mg/kg，每12小时1次，连续2日；1个月以上小儿每日10mg/kg，每12小时1次，连服4次。 3&nbsp;老年患者，口服，按每日10mg/kg，空腹顿服。 [展开]  应空腹服药。 1&nbsp;抗结核治疗成人：口服，一日0.45g～0.60g，空腹顿服，每日不超过1.2g；1个月以上小儿每日按体重10～20mg/kg，空腹顿服，每日量不超过0.6g。 2&nbsp;脑膜炎奈瑟菌带菌者：成人5mg/kg，每12小时1次，连续2日；1个月以上小儿每日10mg/kg，每12小时1次，连服4次。 3&nbsp;老年患者，口服，按每日10mg/kg，空腹顿服。  [收起]  【不良反应】  畏寒、头昏、发热、寒战及食欲减退，恶心呕吐。 [展开] 畏寒、头昏、发热、寒战及食欲减退，恶心呕吐。 [收起]  【禁忌】  1 对本品过敏者禁用。 2 严重肝功能不全患者禁用。 3 胆道阻塞患者禁用。 4 孕妇禁用。 [展开] 1 对本品过敏者禁用。 2 严重肝功能不全患者禁用。 3 胆道阻塞患者禁用。 4 孕妇禁用。 [收起]  【注意事项】  1 酒精中毒、肝功能损害者慎用。婴儿、3个月以上孕妇和哺乳期妇女慎用。 2 对诊断的干扰：可引起直接抗球蛋白试验（Coombs试验）阳性；干扰血清叶酸浓度测定和血清维生素B12浓度测定结果；可使磺溴酞钠试验滞留出现假阳性；可干扰利用分光光度计或颜色改变而进行的各项尿液分析试验的结果；可使血液尿素氮、血清碱性磷酸酶、血清丙氨酸氨基转移酶、门冬氨酸氨基转移酶、血清胆红素及血清尿酸浓度测定结果增高。 3 利福平可致肝功能不全，在原有肝病患者或本品与其他肝毒性药物同服时有伴发黄疸死亡病例的报道，因此原有肝病患者，仅在有明确指征情况下方可慎用，治疗开始前、治疗中严密观察肝功能变化，肝损害一旦出现，立即停药。 4 高胆红素血症系肝细胞性和胆汁潴留的混合型，轻症患者用药中自行消退，重者需停药观察。血胆红素升高也可能是利福平与胆红素竞争排泄的结果。治疗初期2～3个月应严密监测肝功能变化。 5 单用利福平治疗结核病或其他细菌性感染时病原菌可迅速产生耐药性，因此本品必须与其他药物合用。治疗可能需持续6个月～2年，甚至数年。 6 利福平可能引起白细胞和血小板减少，并导致齿龈出血和感染、伤口愈合延迟等。此时应避免拔牙等手术、并注意口腔卫生、刷牙及剔牙均需慎重，直至血象恢复正常。用药期间应定期检查周围血象。 7 利福平应于餐前l小时或餐后2小时服用，清晨空腹一次服用吸收最好，因进食影响本品吸收。 8 肝功能减退的患者常需减少剂量，每日剂量≤8mg/kg。 9 肾功能减退者不需减量。在肾小球滤过率减低或无尿患者中利福平的血药浓度无显著改变。 10 服药后尿、唾液、汗液等排泄物均可显桔红色。 [展开] 1 酒精中毒、肝功能损害者慎用。婴儿、3个月以上孕妇和哺乳期妇女慎用。 2 对诊断的干扰：可引起直接抗球蛋白试验（Coombs试验）阳性；干扰血清叶酸浓度测定和血清维生素B12浓度测定结果；可使磺溴酞钠试验滞留出现假阳性；可干扰利用分光光度计或颜色改变而进行的各项尿液分析试验的结果；可使血液尿素氮、血清碱性磷酸酶、血清丙氨酸氨基转移酶、门冬氨酸氨基转移酶、血清胆红素及血清尿酸浓度测定结果增高。 3 利福平可致肝功能不全，在原有肝病患者或本品与其他肝毒性药物同服时有伴发黄疸死亡病例的报道，因此原有肝病患者，仅在有明确指征情况下方可慎用，治疗开始前、治疗中严密观察肝功能变化，肝损害一旦出现，立即停药。 4 高胆红素血症系肝细胞性和胆汁潴留的混合型，轻症患者用药中自行消退，重者需停药观察。血胆红素升高也可能是利福平与胆红素竞争排泄的结果。治疗初期2～3个月应严密监测肝功能变化。 5 单用利福平治疗结核病或其他细菌性感染时病原菌可迅速产生耐药性，因此本品必须与其他药物合用。治疗可能需持续6个月～2年，甚至数年。 6 利福平可能引起白细胞和血小板减少，并导致齿龈出血和感染、伤口愈合延迟等。此时应避免拔牙等手术、并注意口腔卫生、刷牙及剔牙均需慎重，直至血象恢复正常。用药期间应定期检查周围血象。 7 利福平应于餐前l小时或餐后2小时服用，清晨空腹一次服用吸收最好，因进食影响本品吸收。 8 肝功能减退的患者常需减少剂量，每日剂量≤8mg/kg。 9 肾功能减退者不需减量。在肾小球滤过率减低或无尿患者中利福平的血药浓度无显著改变。 10 服药后尿、唾液、汗液等排泄物均可显桔红色。 [收起]  【特殊人群用药】   儿童注意事项： 本品在5岁以下小儿应用的安全性尚未确立。 妊娠与哺乳期注意事项： 1.利福平可透过胎盘，动物实验曾引起畸胎。人类虽尚 无致畸报道，但目前无足够资料表明可在妊娠期安全应用。 2.利福平可由乳汁排泄，哺乳期妇女用药应充分权衡利 弊后决定是否用药。 老人注意事项： 老年患者肝功能有所减退，用药量应酌减。  【药物相互作用】  1 服用利福平时每日饮酒可导致利福平性肝毒性发生率增加，并增加利福平的代谢，需调整利福平剂量，并密切监督患者有无肝毒性征出现。 2 肾上腺皮质激素(糖皮质激素、盐皮质激素)、抗凝药、香豆素或茚满二酮衍生物、口服降血糖药、促皮质素、氨苯砜、洋地黄苷类、丙吡胺、奎尼丁等与利福平合用时，由于后者对肝微粒体酶活性的刺激作用，可使上述药物的药效减低，因此除地高辛和氨苯砜外，在用利福平前和疗程中上述药物需调整剂量。本品与香豆素或茚满二酮类合用时应每日或定期测定凝血酶元时间，据以调整剂量。 3 对氨基水杨酸盐可影响利福平的吸收，导致利福平血药浓度减低；患者服用对氨基水杨酸盐和利福平时，两药之间至少相隔 6小时。 4 利福平可刺激雌激素的代谢或减少其肠肝循环，降低口服避孕药的作用，导致月经不规则，月经间期出血和计划外妊娠，患者服用利福平时，应改用其他避孕方法。 5 利福平可诱导肝微粒体酶，增加抗肿瘤药达卡巴嗪(dacarbazine)、环磷酰胺的代谢，烷化代谢物的形成，促使白细胞减低，因此需调整剂量。 6 异烟肼与利福平或咪康唑(静脉)、酮康唑合用可增加肝毒性发生的危险，尤其是原有肝功能损害者和异烟肼快乙酰化患者。此外，异烟肼或利福平与咪康唑或酮康唑合用，可使后两者血药浓度减低，故本品及异烟肼不宜与咪唑类合用。 7 利福平与地西泮(安定)合用可增加后者的消除，使其血药浓度减低，故需调整剂量。 8 利福平与乙硫异烟胺合用可加重其不良反应。 9 利福平可增加左旋甲状腺素在肝脏中的降解，因此两者合用时左旋甲状腺素剂量应增加。利福平亦可增加美沙酮、美西律在肝脏中的代谢，引起美沙酮撤药症状和美西律血药浓度减低，故合用时后两者需调整剂量。 利福平可增加苯妥英钠在肝脏中的代谢，故二者合用时应测定苯妥英钠血药浓度并调整用量。 10 丙磺舒可与利福平竞争被肝细胞的摄入，使利福平血药浓度增高并产生毒性反应。但该作用不稳定，故通常不宜加用两磺舒以增高利福平的血药浓度。 [展开]  1 服用利福平时每日饮酒可导致利福平性肝毒性发生率增加，并增加利福平的代谢，需调整利福平剂量，并密切监督患者有无肝毒性征出现。 2 肾上腺皮质激素(糖皮质激素、盐皮质激素)、抗凝药、香豆素或茚满二酮衍生物、口服降血糖药、促皮质素、氨苯砜、洋地黄苷类、丙吡胺、奎尼丁等与利福平合用时，由于后者对肝微粒体酶活性的刺激作用，可使上述药物的药效减低，因此除地高辛和氨苯砜外，在用利福平前和疗程中上述药物需调整剂量。本品与香豆素或茚满二酮类合用时应每日或定期测定凝血酶元时间，据以调整剂量。 3 对氨基水杨酸盐可影响利福平的吸收，导致利福平血药浓度减低；患者服用对氨基水杨酸盐和利福平时，两药之间至少相隔 6小时。 4 利福平可刺激雌激素的代谢或减少其肠肝循环，降低口服避孕药的作用，导致月经不规则，月经间期出血和计划外妊娠，患者服用利福平时，应改用其他避孕方法。 5 利福平可诱导肝微粒体酶，增加抗肿瘤药达卡巴嗪(dacarbazine)、环磷酰胺的代谢，烷化代谢物的形成，促使白细胞减低，因此需调整剂量。 6 异烟肼与利福平或咪康唑(静脉)、酮康唑合用可增加肝毒性发生的危险，尤其是原有肝功能损害者和异烟肼快乙酰化患者。此外，异烟肼或利福平与咪康唑或酮康唑合用，可使后两者血药浓度减低，故本品及异烟肼不宜与咪唑类合用。 7 利福平与地西泮(安定)合用可增加后者的消除，使其血药浓度减低，故需调整剂量。 8 利福平与乙硫异烟胺合用可加重其不良反应。 9 利福平可增加左旋甲状腺素在肝脏中的降解，因此两者合用时左旋甲状腺素剂量应增加。利福平亦可增加美沙酮、美西律在肝脏中的代谢，引起美沙酮撤药症状和美西律血药浓度减低，故合用时后两者需调整剂量。 利福平可增加苯妥英钠在肝脏中的代谢，故二者合用时应测定苯妥英钠血药浓度并调整用量。 10 丙磺舒可与利福平竞争被肝细胞的摄入，使利福平血药浓度增高并产生毒性反应。但该作用不稳定，故通常不宜加用两磺舒以增高利福平的血药浓度。  [收起]  【药理作用】  本品每丸含利福平0.15 g，内容物为橙红或暗红色粉末。 利福平为一种半合成广谱杀菌剂。本品与其它抗结核药联合用于结核病初治与复治。亦适用于无症状脑膜炎球菌带菌者，以消除鼻咽部奈琵氏脑膜炎球菌，（本品不适用于脑膜炎球菌感染的治疗。）利福平亦可考虑用于流感杆菌接触者预防感染 ；与其它药物联合用于麻风，不典型分枝杆菌感染的治疗 [展开]  本品每丸含利福平0.15 g，内容物为橙红或暗红色粉末。 利福平为一种半合成广谱杀菌剂。本品与其它抗结核药联合用于结核病初治与复治。亦适用于无症状脑膜炎球菌带菌者，以消除鼻咽部奈琵氏脑膜炎球菌，（本品不适用于脑膜炎球菌感染的治疗。）利福平亦可考虑用于流感杆菌接触者预防感染 ；与其它药物联合用于麻风，不典型分枝杆菌感染的治疗  [收起]  【贮藏】     密封，在干燥阴暗处保存。有效期：二年。    【包装】    0.15g &nbsp;&nbsp;   【有效期】    24个月。   【批准文号】    国药准字H20045574   【批准日期】    2010-8-30 0:00:00   【生产企业】   企业名称：辽宁先臻制药有限公司  生产地址：鞍山高新技术产业开发区兴盛南路42号  联系电话：0412-8233095 如有问题可与生产企业联系  【产地】","name":"利福平胶囊","price":978,"rcount":0,"tag":"避孕药,恶心呕吐,血小板减少,结核病,过敏,其他,维生素","type":"化学药品"},{"count":0,"description":"如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师","fcount":0,"id":633,"img":"http://tnfs.tngou.net/img/drug/081018/ba431b176f22bef2d28d4d79336294c1.jpg","keywords":"本品 布洛芬 药品 不良反应 药物 ","message":"【批准文号】 国药准字H22026320 【药品类型】 解热镇痛 【中文名】 迪瑞制药 布洛芬胶囊 【产品英文名】 Ibuprofen Capsules 【生产企业】 长春迪瑞制药有限公司 【适应症】 用于缓解轻至中度疼痛如头痛、关节痛、偏头痛、牙痛、肌肉痛、神经痛、痛经。也用于普通感冒或流行性感冒引起的发热。 【药品性状】  【药品禁忌】 1.对其他非甾体抗炎药过敏者禁用。2.孕妇及哺乳期妇女禁用。3.对阿司匹林过敏的哮喘患者禁用。 【药理作用】 本品能抑制前列腺素的合成，具有镇痛、解热和抗炎的作用。本品口服吸收迅速。 【药物相互作用】 1.本品与其他解热、镇痛、抗炎药物同用时可增加胃肠道不良反应，并可能导致溃疡。2.本品与肝素、双香豆素等抗凝药同用时，可导致凝血酶原时间延长，增加出血倾向。3.本品与地高辛、甲氨蝶呤、口服降血糖药物同用时，能使这些药物的血药浓度增高，不宜同用。4.本品与呋塞米（呋喃苯胺酸）同用时，后者的排钠和降压作用减弱；与抗高血压药同用时，也降低后者的降压效果。5.如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 【不良反应】 1.少数病人可出现恶心、呕吐、胃烧灼感或轻度消化不良、胃肠道溃疡及出血、转氨酶升高、头痛、头晕、耳鸣、视力模糊、精神紧张、嗜睡、下肢水肿或体重骤增。2.罕见皮疹、过敏性肾炎、膀胱炎、肾病综合征、肾乳头坏死或肾功能衰竭、支气管痉挛。 【产品规格】 0.2g 【包装规格】  【药品成分】  【孕妇用药】 暂无相关信息 【儿童用药】 暂无相关信息 【老年患者用药】 暂无相关信息 【用法用量】 口服。成人一次1粒，若持续疼痛或发热，可间隔4～6小时重复用药1次，24小时不超过4次。 【贮藏方法】 密封。 【注意事项】 1.本品为对症治疗药，不宜长期或大量使用，用于止痛不得超过5天，用于解热不得超过3天，如症状不缓解，请咨询医师或药师。2.不能同时服用其他含有解热镇痛药的药品（如某些复方抗感冒药）。3.服用本品期间不得饮酒或含有酒精的饮料。4.有下列情况患者慎用：60岁以上、支气管哮喘、肝肾功能不全、凝血机制或血小板功能障碍（如血友病）。5.下列情况患者应在医师指导下使用：有消化性溃疡史、胃肠道出血、心功能不全、高血压。6.如服用过量或出现严重不良反应，应立即就医。7.对本品过敏者禁用，过敏体质者慎用。8.本品性状发生改变时禁止使用。9.请将本品放在儿童不能接触的地方。10.儿童必须在成人监护下使用。11.如正在使用其他药品，使用本品前请咨询医师或药师。 \u2014 该说明书仅作参考","name":"布洛芬胶囊","price":78,"rcount":0,"tag":"哮喘,肾炎,高血压,解热镇痛,肾病,肾病综合征,过敏,其他,痛经,消化不良,牙痛,其他药品","type":"化学药品"},{"count":0,"description":"功能主治 用于类风湿关节炎,风湿性关节炎,骨关节炎,柱关节病,痛风性关节炎的冶疗.还可用于牙痛,手术后疼痛及外伤性疼痛","fcount":0,"id":690,"img":"http://tnfs.tngou.net/img/drug/081018/348b233bfe09d3e1f476631da058bea7.jpg","keywords":"服用 本品 医师 相互作用 指导下 ","message":"【药品名称】   通用名称：天麻胶囊   【成份】   天麻、羌活、独活、杜仲(盐炒)、牛膝、粉萆 、附子(制)、当归、地黄、玄参。  【性状】    本品为胶囊剂，内容物为棕色的颗粒，气微香，味微甜，略苦麻。   【功能主治】  祛风除湿，舒筋通络，活血止痛。用于肢体拘挛，手足麻木，腰腿酸痛。 [展开]  祛风除湿，舒筋通络，活血止痛。用于肢体拘挛，手足麻木，腰腿酸痛。  [收起]  【规格】   每粒装0.25克   【用法用量】  口服。一次6粒，一日2～3次。 [展开] 口服。一次6粒，一日2～3次。 [收起]  【禁忌】  儿童、孕妇禁用。 [展开]  儿童、孕妇禁用。  [收起]  【注意事项】  1.忌寒凉及油腻食物。 2.本品宜饭后服用。 3.不宜在服药期间同时服用其它泻火及滋补性中药。 4.热痹者不适用，主要表现为关节肿痛如灼、痛处发热，疼痛窜痛无定处，口干唇燥。 5.严格按照用法用量服用。 6.有高血压、心脏病、肝病、糖尿病、肾病等慢性病严重者应在医师指导下服用。 7.服药7天症状无缓解，应去医院就诊。 8.哺乳期妇女、年老体弱者应在医师指导下服用。 9.对本品过敏者禁用，过敏体质者慎用。 10.本品性状发生改变时禁止使用。 11.请将本品放在儿童不能接触的地方。 12.如正在使用其他药品，使用本品前请咨询医师或药师。 [展开]  1.忌寒凉及油腻食物。 2.本品宜饭后服用。 3.不宜在服药期间同时服用其它泻火及滋补性中药。 4.热痹者不适用，主要表现为关节肿痛如灼、痛处发热，疼痛窜痛无定处，口干唇燥。 5.严格按照用法用量服用。 6.有高血压、心脏病、肝病、糖尿病、肾病等慢性病严重者应在医师指导下服用。 7.服药7天症状无缓解，应去医院就诊。 8.哺乳期妇女、年老体弱者应在医师指导下服用。 9.对本品过敏者禁用，过敏体质者慎用。 10.本品性状发生改变时禁止使用。 11.请将本品放在儿童不能接触的地方。 12.如正在使用其他药品，使用本品前请咨询医师或药师。  [收起]  【药物相互作用】  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [展开] 如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。  [收起]  【贮藏】     密封。    【包装】    0.25gx50片 0.25gx50粒 &nbsp;&nbsp;   【批准文号】    国药准字Z22020342   【批准日期】    2010-5-20 0:00:00   【生产企业】   企业名称：吉林济邦药业有限公司  生产地址：吉林省舒兰市济邦路8号  联系电话：0432-8222223  如有问题可与生产企业联系  【产地】","name":"天麻胶囊","price":248,"rcount":0,"tag":"风湿疼痛,高血压,肾病,过敏,类风湿,头痛头晕,肌肉关节痛,其他,糖尿病,其他药品","type":"中成药"},{"count":0,"description":"功能主治 温肾补脾，养血益精。用于脾肾虚损，腰膝酸痛，阳萎遗精，耳鸣目眩，精血亏耗，肌体瘦弱，食欲减退，牙根酸痛。","fcount":0,"id":756,"img":"http://tnfs.tngou.net/img/drug/081018/e43cd41280b3d48fde59ffadb12a1275.jpg","keywords":"本品 收起 展开 相互作用 医师 ","message":"【药品名称】   商品名称：美迪生 通用名称：还少胶囊   【成份】   熟地黄、山茱萸、山药(炒)、枸杞子、杜仲(盐制)、巴戟天(炒)、肉苁蓉、五味子、小茴香(盐制)、楮实子、牛膝、茯苓等15味  【功能主治】  温肾补脾，养血益精。用于脾肾虚损，腰膝酸痛，阳萎遗精，耳鸣目眩，精血亏耗，肌体瘦弱，食欲减退，牙根酸痛。 [展开] 温肾补脾，养血益精。用于脾肾虚损，腰膝酸痛，阳萎遗精，耳鸣目眩，精血亏耗，肌体瘦弱，食欲减退，牙根酸痛。 [收起]  【规格】   每粒装0.38克   【用法用量】  口服。一次5粒，一日2～3次 [展开] 口服。一次5粒，一日2～3次 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  伤风感冒及热症患者忌用 [展开]  伤风感冒及热症患者忌用  [收起]  【注意事项】  1.忌辛辣、生冷、油腻食物。2.本品宜饭前服用。3.高血压、心脏病、肝病、糖尿病、肾病等慢性病严重者应在医师指导下服用。4.本品不宜长期服用，服药2周症状无缓解，应去医院就诊。5.对本品过敏者禁用，过敏体质者慎用。6.本品性状发生改变时禁止使用。7.请将本品放在儿童不能接触的地方。8.如正在使用其他药品，使用本品前请咨询医师或药师。 [展开] 1.忌辛辣、生冷、油腻食物。2.本品宜饭前服用。3.高血压、心脏病、肝病、糖尿病、肾病等慢性病严重者应在医师指导下服用。4.本品不宜长期服用，服药2周症状无缓解，应去医院就诊。5.对本品过敏者禁用，过敏体质者慎用。6.本品性状发生改变时禁止使用。7.请将本品放在儿童不能接触的地方。8.如正在使用其他药品，使用本品前请咨询医师或药师。 [收起]  【药物相互作用】  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师 [展开]  如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师  [收起]  【药理作用】  尚不明确 [展开]  尚不明确  [收起]  【贮藏】    密封，置阴凉处   【包装】    每粒装0.38g 0.38gx30片 60g 0.38gx30粒 &nbsp;&nbsp;   【有效期】    24个月   【批准文号】    国药准字Z20055424   【批准日期】    2010-5-10 0:00:00   【生产企业】   企业名称：重庆三峡云海药业有限责任公司  生产地址：重庆市云阳县工业园区  联系电话：0238-5867863，0238-5867836  如有问题可与生产企业联系  【产地】","name":"还少胶囊","price":931,"rcount":0,"tag":"内分泌失调,高血压,肾病,过敏,其他,糖尿病,其他药品","type":"中成药"},{"count":0,"description":"适应症 1、念珠菌病；2、隐球菌病；3、球孢子菌病4、用于接受化疗、放疗和免疫抑制治疗患者的预防念珠菌感染的治疗；5、本品亦可替代伊曲康唑用于芽生菌病和组织胞浆菌...","fcount":0,"id":874,"img":"http://tnfs.tngou.net/img/drug/081018/096c6063532981b8545f75f989ab7146.jpg","keywords":"本品 治疗 念珠菌 血药浓度 剂量 ","message":"【药品名称】   通用名称：氟康唑胶囊 英文名称：Fluconazole  【成份】   　　本品主要成分为氟康唑  【性状】    　　本品的内容物为白色或类白色粉末。   【 适应症 】  本品主要用于以下适应症中病情较重的患者： 1.念珠菌病：用于治疗口咽部和食道念珠菌感染；播散性念珠菌病，包括腹膜炎、肺炎、尿路感染等；念珠菌外阴阴道炎。尚可用于骨髓移植患者接受细胞毒类药物或放射治疗时，预防念珠菌感染的发生。 2.隐球菌病：用于治疗脑膜以外的新型隐球菌病；治疗隐球菌脑膜炎时，本品可作为两性霉素B联合氟胞嘧啶初治后的维持治疗药物。 3.球孢子菌病。 4.用于接受化疗、放疗和免疫抑制治疗患者的预防治疗。 5.本品亦可替代伊曲康唑用于芽生菌病和组织胞浆菌病的治疗。 [展开] 本品主要用于以下适应症中病情较重的患者： 1.念珠菌病：用于治疗口咽部和食道念珠菌感染；播散性念珠菌病，包括腹膜炎、肺炎、尿路感染等；念珠菌外阴阴道炎。尚可用于骨髓移植患者接受细胞毒类药物或放射治疗时，预防念珠菌感染的发生。 2.隐球菌病：用于治疗脑膜以外的新型隐球菌病；治疗隐球菌脑膜炎时，本品可作为两性霉素B联合氟胞嘧啶初治后的维持治疗药物。 3.球孢子菌病。 4.用于接受化疗、放疗和免疫抑制治疗患者的预防治疗。 5.本品亦可替代伊曲康唑用于芽生菌病和组织胞浆菌病的治疗。 [收起]  【规格】   0.1克   【用法用量】  　　口服。成人 (1)播散性念珠菌病：首次剂量0.4g，以后一次0.2g，一日1次，至少4周，症状缓解后至少持续2周。(2)食道念珠菌病：首次剂量0.2g，以后一次0.1g，一日1次，持续至少3周，症状缓解后至少持续2周。根据治疗反应，也可加大剂量至一次0.4g，一日1次。(3)口咽部念珠菌病：首次剂量0.2g，以后一次0.1g，一日1次，疗程至少2周。(4)念珠菌外阴阴道炎：单剂量，0.15g。(5)预防念珠菌病：有预防用药指征者 0.2～0.4g，一日1次。 肾功能不全者 若只需给药1次，不用调节剂量;需多次给药时，第一及第二日应给常规剂量，此后应按肌酐清除率来调节给药剂量，如下表所述：肌酐清除率(ml/分钟)剂 量 &gt;50 常规剂量 11～50 常规剂量的一半进行常规透析的病人每次透析后给药1次小儿 治疗方案尚未建立。有资料报道起始剂量按体重一日3～6mg/kg，一日1次，治疗少数出生2周至14岁的小儿患者，结果是安全的。 [展开]  　　口服。成人 (1)播散性念珠菌病：首次剂量0.4g，以后一次0.2g，一日1次，至少4周，症状缓解后至少持续2周。(2)食道念珠菌病：首次剂量0.2g，以后一次0.1g，一日1次，持续至少3周，症状缓解后至少持续2周。根据治疗反应，也可加大剂量至一次0.4g，一日1次。(3)口咽部念珠菌病：首次剂量0.2g，以后一次0.1g，一日1次，疗程至少2周。(4)念珠菌外阴阴道炎：单剂量，0.15g。(5)预防念珠菌病：有预防用药指征者 0.2～0.4g，一日1次。 肾功能不全者 若只需给药1次，不用调节剂量;需多次给药时，第一及第二日应给常规剂量，此后应按肌酐清除率来调节给药剂量，如下表所述：肌酐清除率(ml/分钟)剂 量 &gt;50 常规剂量 11～50 常规剂量的一半进行常规透析的病人每次透析后给药1次小儿 治疗方案尚未建立。有资料报道起始剂量按体重一日3～6mg/kg，一日1次，治疗少数出生2周至14岁的小儿患者，结果是安全的。  [收起]  【不良反应】  　　1.常见消化道反应，表现为恶心、呕吐、腹痛或腹泻等。 　　2.过敏反应：可表现为皮疹，偶可发生严重的剥脱性皮炎(常伴随肝功能损害)、渗出性多形红斑。 　　3.肝毒性：治疗过程中可发生轻度一过性血清氨基转移酶升高，偶可出现肝毒性症状，尤其易发生于有严重基础疾病(如艾滋病和癌症)的患者。 　　4.可见头晕、头痛。 　　5.某些患者，尤其有严重基础疾病(如艾滋病和癌症)的患者，可能出现肾功能异常。 　　6.偶可发生周围血象一过性中性粒细胞减少和血小板减少等血液学检查指标改变，尤其易发生于有严重基础疾病(如艾滋病和癌症)的患者。 [展开]  　　1.常见消化道反应，表现为恶心、呕吐、腹痛或腹泻等。 　　2.过敏反应：可表现为皮疹，偶可发生严重的剥脱性皮炎(常伴随肝功能损害)、渗出性多形红斑。 　　3.肝毒性：治疗过程中可发生轻度一过性血清氨基转移酶升高，偶可出现肝毒性症状，尤其易发生于有严重基础疾病(如艾滋病和癌症)的患者。 　　4.可见头晕、头痛。 　　5.某些患者，尤其有严重基础疾病(如艾滋病和癌症)的患者，可能出现肾功能异常。 　　6.偶可发生周围血象一过性中性粒细胞减少和血小板减少等血液学检查指标改变，尤其易发生于有严重基础疾病(如艾滋病和癌症)的患者。  [收起]  【禁忌】  　　对本品或其他吡咯类药物有过敏史者禁用。 [展开]  　　对本品或其他吡咯类药物有过敏史者禁用。  [收起]  【注意事项】  　　1.本品与其他吡咯类药物可发生交叉过敏反应，因此对任何一种吡咯类药物过敏者禁用本品。 　　2.由于本品主要自肾排出，因此治疗中需定期检查肾功能。用于肾功能减退患者需减量应用。 　　3.本品目前在免疫缺陷者中的长期预防用药，已导致念珠菌属等对氟康唑等吡咯类抗真菌药耐药性的增加，故需掌握指征，避免无指征预防用药。 　　4.治疗过程中可发生轻度一过性血清氨基转移酶升高，偶可出现肝毒性症状。因此用本品治疗开始前和治疗中均应定期检查肝功能，如肝功能出现持续异常，或肝毒性临床症状时均需立即停用本品。 　　5.本品与肝毒性药物合用、需服用本品两周以上或接受多倍于常用剂量的本品时，可使肝毒性的发生率增高，故需严密观察，在治疗前和治疗期间每两周进行一次肝功能检查。 　　6.本品应用疗程应视感染部位及个体治疗反应而定。一般治疗应持续至真菌感染的临床表现及实验室检查指标显示真菌感染消失为止。隐球菌脑膜炎或反复发作口咽部念珠菌病的艾滋病患者需用本品长期维持治疗以防止复发。 　　7.接受骨髓移植者，如严重粒细胞减少已先期发生，则应预防性使用本品，直至中性粒细胞计数上升至1×109/L以上后7天。 　　8.肾功能损害者，可按前述方案调整用药剂量(见【用法用量】);血液透析患者在每次透析后可给予本品一日量，因为3小时血液透析可使本品的血药浓度降低约50%。 [展开]  　　1.本品与其他吡咯类药物可发生交叉过敏反应，因此对任何一种吡咯类药物过敏者禁用本品。 　　2.由于本品主要自肾排出，因此治疗中需定期检查肾功能。用于肾功能减退患者需减量应用。 　　3.本品目前在免疫缺陷者中的长期预防用药，已导致念珠菌属等对氟康唑等吡咯类抗真菌药耐药性的增加，故需掌握指征，避免无指征预防用药。 　　4.治疗过程中可发生轻度一过性血清氨基转移酶升高，偶可出现肝毒性症状。因此用本品治疗开始前和治疗中均应定期检查肝功能，如肝功能出现持续异常，或肝毒性临床症状时均需立即停用本品。 　　5.本品与肝毒性药物合用、需服用本品两周以上或接受多倍于常用剂量的本品时，可使肝毒性的发生率增高，故需严密观察，在治疗前和治疗期间每两周进行一次肝功能检查。 　　6.本品应用疗程应视感染部位及个体治疗反应而定。一般治疗应持续至真菌感染的临床表现及实验室检查指标显示真菌感染消失为止。隐球菌脑膜炎或反复发作口咽部念珠菌病的艾滋病患者需用本品长期维持治疗以防止复发。 　　7.接受骨髓移植者，如严重粒细胞减少已先期发生，则应预防性使用本品，直至中性粒细胞计数上升至1×109/L以上后7天。 　　8.肾功能损害者，可按前述方案调整用药剂量(见【用法用量】);血液透析患者在每次透析后可给予本品一日量，因为3小时血液透析可使本品的血药浓度降低约50%。  [收起]  【特殊人群用药】   儿童注意事项： 本品对小儿的影响缺乏充足的研究资料，虽然少数出生2周至14岁小儿患者以每日 3～6mg/kg（按体重）剂量治疗未发生不良反应，但小儿仍不宜应用。 妊娠与哺乳期注意事项： 1．动物试验中，本品高剂量给予动物时可出现流产、死胎增多、幼年动物肋骨畸形、 腭裂等变化。虽然在人类中未发现此类情况，但孕妇仍应禁用。 2．尚无母乳中含本品浓度的数据，故哺乳期妇女慎用或服用本品时暂停哺乳。 老人注意事项： 肾功能无减退的老年患者无须调整剂量。肾功能减退的老年患者须根据肌酐清除率调 整剂量（详见　　【用法用量】）。  【药物相互作用】  　　1.本品与异烟肼或利福平合用时，可使本品的浓度降低。 　　2.本品与甲苯磺丁脲、氯磺丁脲和格列吡嗪等磺酰脲类降血糖药合用时，可使此类药物的血药浓度升高而可能导致低血糖，因此需监测血糖，并减少磺酰脲类降血糖药的剂量。 　　3.高剂量本品和环孢素合用时，可使环孢素的血药浓度升高，致毒性反应发生的危险性增加，因此必须在监测环孢素血药浓度并调整剂量的情况下方可谨慎应用。 　　4.本品与氢氯噻嗪合用，可使本品的血药浓度升高。 　　5.本品与茶碱合用时，茶碱血药浓度约可升高13%，可导致毒性反应，故需监测茶碱的血药浓度。 　　6.本品与华法林等双香豆素类抗凝药合用时，可增强双香豆素类抗凝药的抗凝作用，致凝血酶原时间延长，故应监测凝血酶原时间并谨慎使用。 　　7.本品与苯妥英钠合用时，可使苯妥英钠的血药浓度升高，故需监测苯妥英钠的血药浓度。 [展开]  　　1.本品与异烟肼或利福平合用时，可使本品的浓度降低。 　　2.本品与甲苯磺丁脲、氯磺丁脲和格列吡嗪等磺酰脲类降血糖药合用时，可使此类药物的血药浓度升高而可能导致低血糖，因此需监测血糖，并减少磺酰脲类降血糖药的剂量。 　　3.高剂量本品和环孢素合用时，可使环孢素的血药浓度升高，致毒性反应发生的危险性增加，因此必须在监测环孢素血药浓度并调整剂量的情况下方可谨慎应用。 　　4.本品与氢氯噻嗪合用，可使本品的血药浓度升高。 　　5.本品与茶碱合用时，茶碱血药浓度约可升高13%，可导致毒性反应，故需监测茶碱的血药浓度。 　　6.本品与华法林等双香豆素类抗凝药合用时，可增强双香豆素类抗凝药的抗凝作用，致凝血酶原时间延长，故应监测凝血酶原时间并谨慎使用。 　　7.本品与苯妥英钠合用时，可使苯妥英钠的血药浓度升高，故需监测苯妥英钠的血药浓度。  [收起]  【药理作用】  　　1.药理本品属吡咯类抗真菌药。抗真菌谱较广。口服及静注本品对人和各种动物真菌感染，如念珠菌感染(包括免疫正常或免疫受损的人和动物的全身性念珠菌病)、新型隐球菌感染(包括颅内感染)、糠秕马拉色菌、小孢子菌属、毛癣菌属、表皮癣菌属、皮炎芽生菌、粗球孢子菌(包括颅内感染)及荚膜组织胞浆菌、斐氏着色菌、卡氏枝孢霉等有效。本品的体外抗菌活性明显低于酮康唑，但本品的体内抗菌活性明显高于体外作用。本品的作用机制主要为高度选择性干扰真菌的细胞色素P-450的活性，从而抑制真菌细胞膜上麦角固醇的生物合成。 &nbsp;　　2.毒理本品对真菌依赖的细胞色素P-450酶具有高度选择性。一日服用本品0.5g，连续28天，已证明对男性的血浆睾丸素浓度及育龄期妇女的甾体激素浓度均无影响。 [展开]  　　1.药理本品属吡咯类抗真菌药。抗真菌谱较广。口服及静注本品对人和各种动物真菌感染，如念珠菌感染(包括免疫正常或免疫受损的人和动物的全身性念珠菌病)、新型隐球菌感染(包括颅内感染)、糠秕马拉色菌、小孢子菌属、毛癣菌属、表皮癣菌属、皮炎芽生菌、粗球孢子菌(包括颅内感染)及荚膜组织胞浆菌、斐氏着色菌、卡氏枝孢霉等有效。本品的体外抗菌活性明显低于酮康唑，但本品的体内抗菌活性明显高于体外作用。本品的作用机制主要为高度选择性干扰真菌的细胞色素P-450的活性，从而抑制真菌细胞膜上麦角固醇的生物合成。 &nbsp;　　2.毒理本品对真菌依赖的细胞色素P-450酶具有高度选择性。一日服用本品0.5g，连续28天，已证明对男性的血浆睾丸素浓度及育龄期妇女的甾体激素浓度均无影响。  [收起]  【贮藏】     　　密封，在阴凉干燥处保存。    【包装】    0.1g/粒x6粒x/盒 0.1gx6片 0.1gx6粒 0.1克x6片 0.1gx6粒/盒 &nbsp;&nbsp;   【有效期】    24个月   【批准文号】    国药准字H20059399   【批准日期】    2010-9-26 0:00:00   【说明书修订日期】    核准日期：2007年3月16日 修改日期：2010年10月01日   【生产企业】   企业名称：广东彼迪药业有限公司  生产地址：开平市月山镇彼迪大道66号；开平市月山镇月山工业园A区12号之一  联系电话：0750-2789374  如有问题可与生产企业联系  【产地】","name":"氟康唑胶囊","price":405,"rcount":0,"tag":"气管炎,扁桃体炎,血小板减少,灰指甲,过敏,阴道炎,其他,低血糖,艾滋病","type":"化学药品"},{"count":0,"description":"功能主治 润肠通便。用于实热津亏便秘。","fcount":0,"id":921,"img":"http://tnfs.tngou.net/img/drug/081018/5457e1f2004bffc012a543b9178f6e61.jpg","keywords":"药品 服用 症状 收起 服药 ","message":"【药品名称】   通用名称：润肠胶囊   【成份】   桃仁、火麻仁、大黄、当归、羌活。  【性状】    本品为胶囊剂，内容物为棕黄色粉末；味苦，涩。   【功能主治】  润肠通便。用于实热津亏便秘。 [展开] 润肠通便。用于实热津亏便秘。 [收起]  【规格】   每粒装0.3克   【用法用量】  口服。一次2粒，一日3次，宜空腹服。 [展开]  口服。一次2粒，一日3次，宜空腹服。  [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【注意事项】  1服药期间忌食生冷、辛辣油腻之物。 2服药后症状无改善，或症状加重，或出现新的症状者，应立即停药并到医院就诊。 3过敏体质者慎用。 4小儿及年老体弱者，应在医师指导下服用。 5药品性状发生改变时禁止服用。 6儿童必须在成人监护下使用。 7请将此药品放在儿童不能接触的地方。 8如正在服用其他药品，使用本品前请咨询医师或药师。 [展开]  1服药期间忌食生冷、辛辣油腻之物。 2服药后症状无改善，或症状加重，或出现新的症状者，应立即停药并到医院就诊。 3过敏体质者慎用。 4小儿及年老体弱者，应在医师指导下服用。 5药品性状发生改变时禁止服用。 6儿童必须在成人监护下使用。 7请将此药品放在儿童不能接触的地方。 8如正在服用其他药品，使用本品前请咨询医师或药师。  [收起]  【贮藏】     密封。    【包装】    0.3gx12片x2板 0.3gx24粒 0.3gx24片 0.3克x12片x2板 0.3gx12粒 &nbsp;&nbsp;   【批准文号】    国药准字Z20050531   【批准日期】    2010-9-2 0:00:00   【生产企业】   企业名称：海南海神同洲制药有限公司  生产地址：海口保税区八号厂房西南角  联系电话：0898-66828411,68531867,68539550,68554073,68537050  如有问题可与生产企业联系  【产地】","name":"润肠胶囊","price":166,"rcount":0,"tag":"便秘,过敏,其他,其他药品","type":"中成药"},{"count":0,"description":"【批准文号】国药准字Z19980097【药品类型】其它妇科药物【中文名】天基生物小金胶囊【产品英文名】【生产企业】四川省天基生物药业有限公司【功能主治】主要用于阴疽初起，皮色不变，肿硬作痛，多发性脓肿，瘿瘤，瘰疬，乳岩，乳癖","fcount":0,"id":1089,"img":"http://tnfs.tngou.net/img/drug/081018/6e7d48bdc3f3738a4e0f54cb992c957f.jpg","keywords":"相关 暂无 信息 药品 四川省 ","message":"【批准文号】 国药准字Z19980097 【药品类型】 其它妇科药物 【中文名】 天基生物 小金胶囊 【产品英文名】  【生产企业】 四川省天基生物药业有限公司 【功能主治】 主要用于阴疽初起，皮色不变，肿硬作痛，多发性脓肿，瘿瘤，瘰疬，乳岩，乳癖。 用于治疗气血瘀带所引起的乳腺增生、乳腺炎、子宫肌瘤、卵巢囊肿、子宫内膜异位、慢性盆腔炎、月经不调、腰酸腹痛、带下量多等症。对淋巴结核、冷性脓肿、无名肿毒、黄褐斑、痤疮等也有很好疗效。 【药品性状】 本品为胶囊剂，内容物为黄褐色粉末；气香，味微苦。 【药品禁忌】 暂无相关信息 【药理作用】 暂无相关信息 【药物相互作用】 暂无相关信息 【不良反应】 暂无相关信息 【产品规格】 每粒装0.3g 【包装规格】  【药品成分】 麝香，土鳖子，制草乌，枫香脂，乳香（制），没药（制），五灵脂（醋炒），当归（酒炒），地龙，香墨。 【孕妇用药】 暂无相关信息 【儿童用药】 暂无相关信息 【老年患者用药】 暂无相关信息 【用法用量】 口服，一次3－7粒，一日2次，小儿酌减。 【贮藏方法】 密封。 【注意事项】 暂无相关信息 \u2014 该说明书仅作参考","name":"小金胶囊","price":204,"rcount":0,"tag":"乳腺增生,子宫内膜异位,月经不调,子宫肌瘤","type":"中成药"},{"count":0,"description":"功能主治 清热解毒，清脑安神。用于头身高热、头昏脑晕，言语狂燥，舌寸眼花，咽喉肿痛，小儿内热惊风抽搐。对高血压、神经官能症、神经性头痛、失眠等皆有清脑镇静作用。","fcount":0,"id":1108,"img":"http://tnfs.tngou.net/img/drug/081018/c9199ac59a59b5fc1975a75db9febbe1.jpg","keywords":"收起 展开 神经官能症 北京市 明确 ","message":"【药品名称】   通用名称：解郁安神胶囊   【成份】   柴胡、郁金、栀子(炒)、半夏(制)、白术(炒)、浮小麦、远志(制)、甘草(炙)、石菖蒲、百合、胆南星、大枣、龙齿、酸枣仁、茯苓、当归。  【性状】   本品为胶囊剂,内容物为棕色至棕褐色的粉末;气微,味苦、辛。  【功能主治】  舒肝解郁，安神定志。用于情志不舒，肝郁气滞等精神刺激所致的心烦、焦虑、失眠、健忘，更年期症候群，神经官能症等。 [展开] 舒肝解郁，安神定志。用于情志不舒，肝郁气滞等精神刺激所致的心烦、焦虑、失眠、健忘，更年期症候群，神经官能症等。 [收起]  【规格】   每粒装0.4克   【用法用量】  口服。一次4粒，一日2次。 [展开] 口服。一次4粒，一日2次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  尚不明确。 [展开] 尚不明确。 [收起]  【注意事项】  请遵医嘱。 [展开] 请遵医嘱。 [收起]  【贮藏】    密闭，防潮。   【包装】    每粒装0.4g &nbsp;&nbsp;   【有效期】    18个月   【批准文号】    国药准字Z20090097   【批准日期】    2009-3-3 0:00:00   【说明书修订日期】    核准日期：2009年03月03日   【生产企业】   企业名称：北京四环科宝制药有限公司  生产地址：北京市丰台区科技园区海鹰路11号  联系电话：010-63786796，63786797，63786799 如有问题可与生产企业联系  【产地】","name":"安神胶囊","price":256,"rcount":0,"tag":"失眠,神经衰弱,偏头疼","type":"中成药"},{"count":0,"description":"【批准文号】国药准字Z22021884【药品类型】月经不调【中文名】东宝五药潮安胶囊【产品英文名】【生产企业】通化东宝五药有限公司【功能主治】活血化瘀，消炎止痛","fcount":0,"id":1124,"img":"http://tnfs.tngou.net/img/drug/081018/72c8632d5ebe1ec9f92cc69d8475c866.jpg","keywords":"相关 暂无 信息 药品 相互作用 ","message":"【批准文号】 国药准字Z22021884 【药品类型】 月经不调 【中文名】 东宝五药 潮安胶囊 【产品英文名】  【生产企业】 通化东宝五药有限公司 【功能主治】 活血化瘀，消炎止痛。用于痛经，月经不调，盆腔炎等。 【药品性状】 本品为肠溶胶囊，内容物为棕褐色；味芳香，微甜。 【药品禁忌】 暂无相关信息 【药理作用】 暂无相关信息 【药物相互作用】 如与其他药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 【不良反应】 暂无相关信息 【产品规格】 每粒装0.25g 【包装规格】  【药品成分】  【孕妇用药】 暂无相关信息 【儿童用药】 暂无相关信息 【老年患者用药】 暂无相关信息 【用法用量】 口服，一次3～5粒，一日3次。 【贮藏方法】 密封。 【注意事项】 孕妇忌服。 \u2014 该说明书仅作参考","name":"潮安胶囊","price":422,"rcount":0,"tag":"月经不调,其他,痛经","type":"中成药"},{"count":0,"description":"功能主治 清热解毒。用于急慢性扁桃体炎，急慢性咽喉炎，上呼吸道感染。","fcount":0,"id":1201,"img":"http://tnfs.tngou.net/img/drug/081018/28249276bcf33ff4a237df355e95d701.jpg","keywords":"服用 药物 收起 相互作用 医师 ","message":"【药品名称】   通用名称：银黄胶囊   【成份】   金银花、黄芩。辅料为：淀粉。  【性状】    本品为胶囊剂，内容物为黄棕色粉末；味微苦。   【功能主治】  清热解毒。用于急慢性扁桃体炎、急慢性咽喉炎、上呼吸道感染。 [展开] 清热解毒。用于急慢性扁桃体炎、急慢性咽喉炎、上呼吸道感染。 [收起]  【规格】   每粒装0.3克   【用法用量】  一次2-4粒，一日4次。 [展开] 一次2-4粒，一日4次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  肾病患者慎用。 [展开]  肾病患者慎用。  [收起]  【注意事项】  1.忌辛辣、鱼腥食物。 2.不宜在服药期间同时服用温补性中成药。 3.脾气虚寒症见有大便溏者慎用。 4.扁桃体化脓及全身高热者应去医院就诊。 5.服药三天后症状无改善，或出现其他症状，应去医院就诊。 6.按照用法用量服用，儿童应在医师指导下服用。 7.药品性状发生改变时禁止服用。 8.儿童必须在成人的监护下使用。 9.请将此药品放在儿童不能接触的地方。 10.如正在服用其他药物，使用本品前请咨询医师或药师。 [展开] 1.忌辛辣、鱼腥食物。 2.不宜在服药期间同时服用温补性中成药。 3.脾气虚寒症见有大便溏者慎用。 4.扁桃体化脓及全身高热者应去医院就诊。 5.服药三天后症状无改善，或出现其他症状，应去医院就诊。 6.按照用法用量服用，儿童应在医师指导下服用。 7.药品性状发生改变时禁止服用。 8.儿童必须在成人的监护下使用。 9.请将此药品放在儿童不能接触的地方。 10.如正在服用其他药物，使用本品前请咨询医师或药师。 [收起]  【药物相互作用】  如与其它药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。 [展开]  如与其它药物同时使用可能会发生药物相互作用，详情请咨询医师或药师。  [收起]  【贮藏】     密封。    【包装】    每粒装0.3g 0.3gx12粒x2板 &nbsp;&nbsp;   【批准文号】    国药准字Z20064122   【批准日期】    2011-3-28 0:00:00   【生产企业】   企业名称：吉林百姓堂药业有限公司  生产地址：四平市铁西区兴红路1622号  联系电话：0434-6668283 0434-3246506 如有问题可与生产企业联系  【产地】","name":"银黄胶囊","price":722,"rcount":0,"tag":"扁桃体炎,肾病,其他,清热解毒,咽痛音哑","type":"中成药"},{"count":0,"description":"功能主治 润肠通便。用于病后津液不足，肝火内炽，便秘腹胀。","fcount":0,"id":1196,"img":"http://tnfs.tngou.net/img/drug/081018/380e43ecf71e08cfb820fe71a149f143.jpg","keywords":"收起 展开 上海市 生产 口服 ","message":"【药品名称】   通用名称：更衣胶囊   【成份】   芦荟280g，朱砂200g。  【性状】    本品为胶囊剂，内容物为赭红色粉末；味苦。   【功能主治】  润肠通便。用于病后津液不足，肝火内炽，便秘腹胀。 [展开] 润肠通便。用于病后津液不足，肝火内炽，便秘腹胀。 [收起]  【规格】   50粒/瓶   【用法用量】  口服。一次 3～6 粒，一日 1～2次，饭前服。 [展开] 口服。一次 3～6 粒，一日 1～2次，饭前服。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  孕妇忌服。 [展开]  孕妇忌服。  [收起]  【注意事项】  请遵医嘱。 [展开] 请遵医嘱。  [收起]  【贮藏】     密闭，在凉暗干燥处保存。    【包装】    50粒/瓶 &nbsp;&nbsp;   【批准文号】    国药准字Z20033077   【批准日期】    2010-9-27 0:00:00   【生产企业】   企业名称：上海雷允上药业有限公司  生产地址：上海市汉口路398号华盛大厦十七楼   联系电话：021-63503535 如有问题可与生产企业联系  【产地】","name":"更衣胶囊","price":271,"rcount":0,"tag":"便秘","type":"中成药"},{"count":0,"description":"功能主治 生津止渴，甘平养胃，涩敛固阴。用于多饮、多尿、多食、消瘦、体倦无力，尿糖及血糖升高之消渴症；轻度及中度成年型糖尿病。","fcount":0,"id":1233,"img":"http://tnfs.tngou.net/img/drug/081018/7b5810223bdc1f90c754fcf0e0225061.jpg","keywords":"糖尿病 明确 尚不 小鼠 收起 ","message":"【药品名称】   通用名称：金芪降糖胶囊   【成份】   　　黄芪、黄连、金银花  【性状】    　　本品为胶囊剂，内容物为棕黄色至棕褐色粉末或颗粒;味苦   【功能主治】  清热益气。主治气虚兼内热之消渴病，症见口渴喜饮，易饥多食，气短乏力等，用于轻、中型非胰岛素依赖型糖尿病。 [展开] 清热益气。主治气虚兼内热之消渴病，症见口渴喜饮，易饥多食，气短乏力等，用于轻、中型非胰岛素依赖型糖尿病。 [收起]  【规格】   每粒装0.4克   【用法用量】  饭前半小时口服。一次6～8粒，一日3次，疗程二个月或遵医嘱。 [展开] 饭前半小时口服。一次6～8粒，一日3次，疗程二个月或遵医嘱。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  　　尚不明确 [展开]  　　尚不明确  [收起]  【注意事项】  尚不明确。 [展开]  尚不明确。  [收起]  【药物相互作用】  尚不明确。 [展开]  尚不明确。  [收起]  【药理作用】  　　毒理研究：给小鼠灌胃相当临床用剂量253倍的金芪降糖胶囊，未见任何毒性反应，可见该药毒性很低，临床用药安全可靠。 　　药理研究：该药对链脲菌素性，四氧嘧啶性糖尿病小鼠均有明显的预防和治疗作用，对胃上腺性高血糖小鼠亦有明显的降血糖作用，但对正常小鼠血糖无影响。该药能改善代糖谢，改善胰质代谢，增强机体对胰岛素的敏感性。上述药理作用为该药临床治疗糖尿病提供了科学依据。 [展开]  　　毒理研究：给小鼠灌胃相当临床用剂量253倍的金芪降糖胶囊，未见任何毒性反应，可见该药毒性很低，临床用药安全可靠。 　　药理研究：该药对链脲菌素性，四氧嘧啶性糖尿病小鼠均有明显的预防和治疗作用，对胃上腺性高血糖小鼠亦有明显的降血糖作用，但对正常小鼠血糖无影响。该药能改善代糖谢，改善胰质代谢，增强机体对胰岛素的敏感性。上述药理作用为该药临床治疗糖尿病提供了科学依据。  [收起]  【贮藏】     　　密封。    【包装】    每粒装0.4g 0.4gx100粒 &nbsp;&nbsp;   【有效期】    36个月   【批准文号】    国药准字Z19980093   【批准日期】    2010-4-28 0:00:00   【生产企业】   企业名称：吉林敖东延边药业股份有限公司  生产地址：吉林省敦化市敖东大街2158号  联系电话：0433-6223692  如有问题可与生产企业联系  【产地】","name":"降糖胶囊","price":670,"rcount":0,"tag":"糖尿病","type":"中成药"}]
     */

    @SerializedName("total")
    private int total;
    @SerializedName("tngou")
    private List<TngouEntity> tngou;

    public static DurgSearch objectFromData(String str) {

        return new Gson().fromJson(str, DurgSearch.class);
    }

    public void setTotal(int total) {
        this.total = total;
    }

    public void setTngou(List<TngouEntity> tngou) {
        this.tngou = tngou;
    }

    public int getTotal() {
        return total;
    }

    public List<TngouEntity> getTngou() {
        return tngou;
    }

    public static class TngouEntity {
        /**
         * count : 0
         * description : 功能主治 清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。
         * fcount : 0
         * id : 20
         * img : http://tnfs.tngou.net/img/drug/081018/3ae4831c202e55785d72a84ed3d020c7.jpg
         * keywords : 扁桃体炎 服用 症状 药品 收起
         * message : 【药品名称】   通用名称：北豆根胶囊 英文名称：Capsulae Menispermi  【成份】   北豆根。辅料为淀粉、糊精，硬脂酸镁。  【性状】   本品为胶囊剂，内容物为灰棕色至黑棕色颗粒或粉末，味苦。  【功能主治】  清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。 [展开] 清热解毒、止咳、祛痰。用于咽喉肿痛，扁桃体炎。 [收起]  【规格】   30毫克   【用法用量】  口服。一次2粒，一日三次。 [展开] 口服。一次2粒，一日三次。 [收起]  【不良反应】  尚不明确。 [展开] 尚不明确。 [收起]  【禁忌】  尚不明确。 [展开]  尚不明确。  [收起]  【注意事项】  1.忌辛辣、鱼腥食物； 2.不宜在服药期间同时服用温补性中成药； 3.凡风寒咽痛症见恶寒、无汗者不宜使用，脾胃虚寒者慎用； 4.急性咽炎服药3天后、慢性咽炎服药7天后症状无改善或出现其他症状，应去医院就诊； 5.急性扁桃体炎用药3天后症状无改善，或出现其他如高热、扁桃体周围炎等症状，应去医院就诊； 6.急性化脓性扁桃体炎，因症情较重，应去医院就诊； 7.按照用法用量服用，儿童应在医师指导下服用； 8.药品性状发生改变时禁止服用； 9.儿童必须在成人的监护下使用； 10.请将此药品放在儿童不能接触的地方； [展开] 1.忌辛辣、鱼腥食物； 2.不宜在服药期间同时服用温补性中成药； 3.凡风寒咽痛症见恶寒、无汗者不宜使用，脾胃虚寒者慎用； 4.急性咽炎服药3天后、慢性咽炎服药7天后症状无改善或出现其他症状，应去医院就诊； 5.急性扁桃体炎用药3天后症状无改善，或出现其他如高热、扁桃体周围炎等症状，应去医院就诊； 6.急性化脓性扁桃体炎，因症情较重，应去医院就诊； 7.按照用法用量服用，儿童应在医师指导下服用； 8.药品性状发生改变时禁止服用； 9.儿童必须在成人的监护下使用； 10.请将此药品放在儿童不能接触的地方；  [收起]  【药物相互作用】  如与其他药品同时使用可能或发生相互作用，详情请咨询医师或药师。 [展开]  如与其他药品同时使用可能或发生相互作用，详情请咨询医师或药师。  [收起]  【贮藏】    密封。   【包装】    30毫克x20粒 30毫克x20片 30毫克x20# 30毫克x10粒x2板 &nbsp;&nbsp;   【有效期】    24个月   【批准文号】    国药准字Z10960048   【批准日期】    2010-4-13 0:00:00   【说明书修订日期】    2010年9月6日   【生产企业】   企业名称：伊春药业有限公司  生产地址：伊春市翠东高新技术工业园区  联系电话：0458-3602854 如有问题可与生产企业联系  【产地】
         * name : 北豆根胶囊
         * price : 11.5
         * rcount : 0
         * tag : 扁桃体炎,咳嗽咳痰,其他,清热解毒,其他药品
         * type : 中成药
         */

        @SerializedName("count")
        private int count;
        @SerializedName("description")
        private String description;
        @SerializedName("fcount")
        private int fcount;
        @SerializedName("id")
        private int id;
        @SerializedName("img")
        private String img;
        @SerializedName("keywords")
        private String keywords;
        @SerializedName("message")
        private String message;
        @SerializedName("name")
        private String name;
        @SerializedName("price")
        private double price;
        @SerializedName("rcount")
        private int rcount;
        @SerializedName("tag")
        private String tag;
        @SerializedName("type")
        private String type;

        public static TngouEntity objectFromData(String str) {

            return new Gson().fromJson(str, TngouEntity.class);
        }

        public void setCount(int count) {
            this.count = count;
        }

        public void setDescription(String description) {
            this.description = description;
        }

        public void setFcount(int fcount) {
            this.fcount = fcount;
        }

        public void setId(int id) {
            this.id = id;
        }

        public void setImg(String img) {
            this.img = img;
        }

        public void setKeywords(String keywords) {
            this.keywords = keywords;
        }

        public void setMessage(String message) {
            this.message = message;
        }

        public void setName(String name) {
            this.name = name;
        }

        public void setPrice(double price) {
            this.price = price;
        }

        public void setRcount(int rcount) {
            this.rcount = rcount;
        }

        public void setTag(String tag) {
            this.tag = tag;
        }

        public void setType(String type) {
            this.type = type;
        }

        public int getCount() {
            return count;
        }

        public String getDescription() {
            return description;
        }

        public int getFcount() {
            return fcount;
        }

        public int getId() {
            return id;
        }

        public String getImg() {
            return img;
        }

        public String getKeywords() {
            return keywords;
        }

        public String getMessage() {
            return message;
        }

        public String getName() {
            return name;
        }

        public double getPrice() {
            return price;
        }

        public int getRcount() {
            return rcount;
        }

        public String getTag() {
            return tag;
        }

        public String getType() {
            return type;
        }

        @Override
        public String toString() {
            return "TngouEntity{" +
                    "count=" + count +
                    ", description='" + description + '\'' +
                    ", fcount=" + fcount +
                    ", id=" + id +
                    ", img='" + img + '\'' +
                    ", keywords='" + keywords + '\'' +
                    ", message='" + message + '\'' +
                    ", name='" + name + '\'' +
                    ", price=" + price +
                    ", rcount=" + rcount +
                    ", tag='" + tag + '\'' +
                    ", type='" + type + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "DurgSearch{" +
                "total=" + total +
                ", tngou=" + tngou +
                '}';
    }
}
